package com.it.main;
/*
 *  데이터 묶는 방법 => 	관련있는 데이터만 묶어서 사용
 *  			 	-------------
 *  				3명의 학생 => 국어, 영어, 수학
 *  				배열, 클래스
 * 	명령문을 묶어서 사용하는 방법 => 메소드
 * 	-------------------------------------------- 클래스(컴포넌트 => 부품)
 * 	메소드 : 기능 (변수를 제어하는 프로그램) => 연산자, 제어문
 * 	----- 재사용이 가능한 기능을 제작
 * 	----- 반복이 많은 경우 (반복 제거)
 * 	----- 구조적인 프로그램 제작 (단락) => 수정이 편리하게, 에러 처리
 * 	메소드 제작 방식 (4가지)
 * 	------------ 입력값(매개변수), 결과값(리턴형)
 * 	게산기 => 사용자 숫자2ㅐ => 결과값은 산술연산값
 * 	로그인 => id,pwd > boolean
 * 	아이디체크 => id => boolean
 * 	검색 => 사용자 : 검색어 ==> []
 * 
 * 사용자가 요청한 값을 이용해서 요청처리 => 처리결과를 보여준다.
 * ----------------------------------------------------------
 * 			리턴형(결과값)					매개변수(입력값)
 * ----------------------------------------------------------
 * 				O							O
 * ----------------------------------------------------------
 * 				O							X	=> Math.random()
 * ----------------------------------------------------------
 * 				X							o	=> void main(String[] arg)
 * 				==> 결과값이 없다 void
 * ----------------------------------------------------------
 * 				X							X	=> System.out.println()
 * ----------------------------------------------------------
 * 
 * 	1. 메소드 : 선언부 / 구현부
 * 						--------객체마다 따라  -----마지막
 * 		  => 종류 (static,instance,abstract,final)
 * 				  ------ 공유		  -------추상
 * 		선엄부
 * 		리턴형 메소드명(매개변수...)
 * 		{
 * 			구현부
 * 			return 결과값
 * 		}
 */
public class MainClass3 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
