package com.it.main;
/*
 * 	1. 조건문
 * 		형식)
 * 			조건문 : true/false => 결과값
 * 				   ----------
 * 					부정연산자(!), 비교연산자 (==, !=, <, >, <=, >=)
 * 					논리연산자 ( &&, || )
 * 			용도 : 오류방지 => 처리가 안되는 부분 (예외처리)
 * 			if(조건문)
 * 			{
 * 				조건이 true일때 처리하는 문장
 * 			}
 * 
 * 			선택 조건문 : true일때 처리, false일때 처리
 * 			=> 로그인 여부 / 아이디 중복 체크 / 검색 여부
 * 			=> 모든 프로그램 언어 => 제어문은 한장문장(명령문)
 * 								=> 여러개의 문장 동시 수행 {}
 * 				예)
 * 					---------
 * 					if(조건문)
 * 					처리문장1
 * 					---------
 * 						처리문장2=> if와 관련이 없는 문장
 * 
 * 					if(조건문)
 * 					{
 * 						처리문장1
 * 						처리문장2
 * 					---------------- 동시처리문장 ( 조건 : true )
 * 					}
 *			 if(조건문)
 * 			{
 * 				조건이 true일때 처리문장
 * 			}
 * 			else
 * 			{
 * 				조건이 false일때 처리문장
 * 			}
 * 
 * 			다중조건문 : 조건에 맞는 조건문만 1개 수행
 *  
 */
public class MainClass {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
